mynamelcz/stm32F4/DEV/sdio_SD/sdio_sd.c
#include "sdio_sd.h"

#include "stm32f4xx_ll.h"



#define NULL 0
#define SDIO_STATIC_FLAG               ((u32)0x000005FF)
#define SDIO_CMD0TIMEOUT                ((u32)0x00010000)

/** 
  * @brief  Mask for errors Card Status R1 (OCR Register) 
  */
#define SD_OCR_ADDR_OUT_OF_RANGE        ((u32)0x80000000)
#define SD_OCR_ADDR_MISALIGNED          ((u32)0x40000000)
#define SD_OCR_BLOCK_LEN_ERR            ((u32)0x20000000)
#define SD_OCR_ERASE_SEQ_ERR            ((u32)0x10000000)
#define SD_OCR_BAD_ERASE_PARAM          ((u32)0x08000000)
#define SD_OCR_WRITE_PROT_VIOLATION     ((u32)0x04000000)
#define SD_OCR_LOCK_UNLOCK_FAILED       ((u32)0x01000000)
#define SD_OCR_COM_CRC_FAILED           ((u32)0x00800000)
#define SD_OCR_ILLEGAL_CMD              ((u32)0x00400000)
#define SD_OCR_CARD_ECC_FAILED          ((u32)0x00200000)
#define SD_OCR_CC_ERROR                 ((u32)0x00100000)
#define SD_OCR_GENERAL_UNKNOWN_ERROR    ((u32)0x00080000)
#define SD_OCR_STREAM_READ_UNDERRUN     ((u32)0x00040000)
#define SD_OCR_STREAM_WRITE_OVERRUN     ((u32)0x00020000)
#define SD_OCR_CID_CSD_OVER_WRIETE      ((u32)0x00010000)
#define SD_OCR_WP_ERASE_SKIP            ((u32)0x00008000)
#define SD_OCR_CARD_ECC_DISABLED        ((u32)0x00004000)
#define SD_OCR_ERASE_RESET              ((u32)0x00002000)
#define SD_OCR_AKE_SEQ_ERROR            ((u32)0x00000008)
#define SD_OCR_ERRORBITS                ((u32)0xFDFFE008)

/** 
  * @brief  Masks for R6 Response 
  */
#define SD_R6_GENERAL_UNKNOWN_ERROR     ((u32)0x00002000)
#define SD_R6_ILLEGAL_CMD               ((u32)0x00004000)
#define SD_R6_COM_CRC_FAILED            ((u32)0x00008000)

#define SD_VOLTAGE_WINDOW_SD            ((u32)0x80100000)
#define SD_HIGH_CAPACITY                ((u32)0x40000000)
#define SD_STD_CAPACITY                 ((u32)0x00000000)
#define SD_CHECK_PATTERN                ((u32)0x000001AA)

#define SD_MAX_VOLT_TRIAL               ((u32)0x0000FFFF)
#define SD_ALLZERO                      ((u32)0x00000000)

#define SD_WIDE_BUS_SUPPORT             ((u32)0x00040000)
#define SD_SINGLE_BUS_SUPPORT           ((u32)0x00010000)
#define SD_CARD_LOCKED                  ((u32)0x02000000)

#define SD_DATATIMEOUT                  ((u32)0xFFFFFF)
#define SD_0TO7BITS                     ((u32)0x000000FF)
#define SD_8TO15BITS                    ((u32)0x0000FF00)
#define SD_16TO23BITS                   ((u32)0x00FF0000)
#define SD_24TO31BITS                   ((u32)0xFF000000)
#define SD_MAX_DATA_LENGTH              ((u32)0x01FFFFFF)

#define SD_HALFFIFO                     ((u32)0x00000008)
#define SD_HALFFIFOBYTES                ((u32)0x00000020)

/** 
  * @brief  Command Class Supported 
  */
#define SD_CCCC_LOCK_UNLOCK             ((u32)0x00000080)
#define SD_CCCC_WRITE_PROT              ((u32)0x00000040)
#define SD_CCCC_ERASE                   ((u32)0x00000020)

/** 
  * @brief  Following commands are SD Card Specific commands.
  *         SDIO_APP_CMD should be sent before sending these commands. 
  */
#define SDIO_SEND_IF_COND               ((u32)0x00000008)

/**
  * @}
  */ 

/** @defgroup STM324x7I_EVAL_SDIO_SD_Private_Macros
  * @{
  */
/**
  * @}
  */ 

/** @defgroup STM324x7I_EVAL_SDIO_SD_Private_Variables
  * @{
  */

static u32 CardType =  SDIO_STD_CAPACITY_SD_CARD_V1_1;
static u32 CSD_Tab[4], CID_Tab[4], RCA = 0;
static u8 SDSTATUS_Tab[16];
volatile u32 StopCondition = 0;
volatile SD_Error TransferError = SD_OK;
volatile u32 DMAEndOfTransfer = 0;

volatile u32 TransferISEnd = 0;

SD_CardInfo SDCardInfo;













extern __weak void HAL_Delay(uint32_t Delay);


SDIO_InitTypeDef SDIO_InitStructure;
SDIO_CmdInitTypeDef SDIO_CmdInitStructure;
SDIO_DataInitTypeDef SDIO_DataInitStructure;
/**
  * @}
  */ 


/** @defgroup STM324x7I_EVAL_SDIO_SD_Private_Function_Prototypes
  * @{
  */
static SD_Error CmdError(void);
static SD_Error CmdResp1Error(u8 cmd);
static SD_Error CmdResp7Error(void);
static SD_Error CmdResp3Error(void);
static SD_Error CmdResp2Error(void);
static SD_Error CmdResp6Error(u8 cmd, u16 *prca);
static SD_Error SDEnWideBus(FunctionalState NewState);
static SD_Error IsCardProgramming(u8 *pstatus);
static SD_Error FindSCR(u16 rca, u32 *pscr);
u8 convert_from_bytes_to_power_of_two(u16 NumberOfBytes);
  
void SD_LowLevel_DeInit(void)
{
	;
}
  
void SD_LowLevel_Init(void)
{
	;
}	
  


//============================================================//

#define SDIO_POWER_STATE_OFF                 ((uint32_t)0x00000000)
#define SDIO_POWER_STATE_ON                  ((uint32_t)0x00000003)

u8 SDIO_GetITStatus(u32 flag)
{
	if(__SDIO_GET_IT(SDIO, flag)){
		return SET;
	}
	return RESET;
	
}
void SDIO_ClearITPendingBit(u32 sdio_IT)
{
	__SDIO_CLEAR_IT(SDIO, sdio_IT);
}

u8 SDIO_GetFlagStatus(uint32_t SDIO_FLAG)
{ 
  if (__SDIO_GET_FLAG(SDIO, SDIO_FLAG)){
    return SET;
  }
  return RESET;
}
void SDIO_ClearFlag(u32 SDIO_FLAG)
{
	__SDIO_CLEAR_FLAG(SDIO, SDIO_FLAG);
}


u32 SDIO_Get_Response(u32 SDIO_RESP)
{
	return SDIO_GetResponse(SDIO, SDIO_RESP);
}

uint8_t SDIO_Get_CommandResponse(void)
{
  return SDIO_GetCommandResponse(SDIO);
}

void SDIO_ITConfig(uint32_t SDIO_IT, FunctionalState NewState)
{
  if (NewState != DISABLE) {
    __SDIO_ENABLE_IT(SDIO, SDIO_IT);
  }
  else{
    __SDIO_DISABLE_IT(SDIO, SDIO_IT);
  } 
}

u32 SDIO_ReadData(void)
{ 
  return SDIO_ReadFIFO(SDIO);
}


extern void sdio_dma_send(u32 *src_addr, u32 bufferSize);
extern void sdio_dma_receive(u32 *src_addr, u32 bufferSize);


void SD_LowLevel_DMA_RxConfig(uint32_t *BufferDST, uint32_t BufferSize)
{
	sdio_dma_receive(BufferDST, BufferSize);
}
void SD_LowLevel_DMA_TxConfig(uint32_t *BufferSRC, uint32_t BufferSize)
{
	sdio_dma_send(BufferSRC, BufferSize);
}



void sdio_set_low_speed(u32 bus_wide)
{
  SDIO_InitStructure.ClockDiv = SDIO_INIT_CLK_DIV;
  SDIO_InitStructure.ClockEdge = SDIO_CLOCK_EDGE_RISING;
  SDIO_InitStructure.ClockBypass = SDIO_CLOCK_BYPASS_DISABLE;
  SDIO_InitStructure.ClockPowerSave = SDIO_CLOCK_POWER_SAVE_DISABLE;
  SDIO_InitStructure.BusWide = bus_wide;
  SDIO_InitStructure.HardwareFlowControl = SDIO_HARDWARE_FLOW_CONTROL_ENABLE;
  SDIO_Init(SDIO, SDIO_InitStructure);
}
void sdio_set_high_speed(u32 bus_wide)
{
  SDIO_InitStructure.ClockDiv = SDIO_TRANSFER_CLK_DIV;
  SDIO_InitStructure.ClockEdge = SDIO_CLOCK_EDGE_RISING;
  SDIO_InitStructure.ClockBypass = SDIO_CLOCK_BYPASS_DISABLE;
  SDIO_InitStructure.ClockPowerSave = SDIO_CLOCK_POWER_SAVE_DISABLE;
  SDIO_InitStructure.BusWide = bus_wide;
  SDIO_InitStructure.HardwareFlowControl = SDIO_HARDWARE_FLOW_CONTROL_ENABLE;
  SDIO_Init(SDIO, SDIO_InitStructure);
}
void sdio_send_cmd(u32 cmd, u32 arg, u32 res)
{
  SDIO_CmdInitStructure.Argument = arg;
  SDIO_CmdInitStructure.CmdIndex = cmd;
  SDIO_CmdInitStructure.Response = res;
  SDIO_CmdInitStructure.WaitForInterrupt = SDIO_WAIT_NO;
  SDIO_CmdInitStructure.CPSM = SDIO_CPSM_ENABLE;
  SDIO_SendCommand(SDIO, &SDIO_CmdInitStructure);
}

void sdio_data_cfg(u32 len,u32 dir, u32 block_sz)
{
  SDIO_DataInitStructure.DataLength = len;
  SDIO_DataInitStructure.TransferDir = dir;
  SDIO_DataInitStructure.DataTimeOut = SD_DATATIMEOUT;
  SDIO_DataInitStructure.DataBlockSize = block_sz;
  SDIO_DataInitStructure.TransferMode = SDIO_TRANSFER_MODE_BLOCK;
  SDIO_DataInitStructure.DPSM = SDIO_DPSM_ENABLE;
  SDIO_ConfigData(SDIO, &SDIO_DataInitStructure);
}




static SD_Error FindSCR(u16 rca, u32 *pscr)
{
  u32 index = 0;
  SD_Error errorstatus = SD_OK;
  u32 tempscr[2] = {0, 0};

