mynamelcz/stm32F4/DEV/sdio_SD/sdio_sd.c
  /*!< Set Block Size To 8 Bytes */
  /*!< Send CMD55 APP_CMD with argument as card's RCA */
  sdio_send_cmd(SD_CMD_SET_BLOCKLEN, (u32)8, SDIO_RESPONSE_SHORT);
 
  errorstatus = CmdResp1Error(SD_CMD_SET_BLOCKLEN);
  if (errorstatus != SD_OK){
	ERR_printf(errorstatus);
    return(errorstatus);
  }

  /*!< Send CMD55 APP_CMD with argument as card's RCA */
  sdio_send_cmd(SD_CMD_APP_CMD, (u32)RCA << 16, SDIO_RESPONSE_SHORT);
  errorstatus = CmdResp1Error(SD_CMD_APP_CMD);
  if (errorstatus != SD_OK){
	ERR_printf(errorstatus);
    return(errorstatus);
  }

 
  sdio_data_cfg(8, SDIO_TRANSFER_DIR_TO_SDIO, SDIO_DATABLOCK_SIZE_8B);

  /*!< Send ACMD51 SD_APP_SEND_SCR with argument as 0 */
  sdio_send_cmd(SD_CMD_SD_APP_SEND_SCR, (u32)0x0, SDIO_RESPONSE_SHORT);
  errorstatus = CmdResp1Error(SD_CMD_SD_APP_SEND_SCR);
  if (errorstatus != SD_OK){
	ERR_printf(errorstatus);
    return(errorstatus);
  }

  while (!(SDIO->STA & (SDIO_FLAG_RXOVERR | SDIO_FLAG_DCRCFAIL | SDIO_FLAG_DTIMEOUT | SDIO_FLAG_DBCKEND | SDIO_FLAG_STBITERR)))
  {
    if (SDIO_GetFlagStatus(SDIO_FLAG_RXDAVL) != RESET){
      *(tempscr + index) = SDIO_ReadData();
		sd_printf("SCR[%d]:0x%x\n",index, tempscr[index]);
		index++;
		*(tempscr + index) = SDIO_ReadData();
    }
  }
  /****************  ADD BY LCZ ***********/
   while((SDIO->STA & SDIO_FLAG_RXACT)){
	   sd_printf("SDIO_ReadData:%d  ,LINE:%d \n", SDIO_ReadData(), __LINE__);
   }
  /***************************************/

  
  if (SDIO_GetFlagStatus(SDIO_FLAG_DTIMEOUT) != RESET){
    SDIO_ClearFlag(SDIO_FLAG_DTIMEOUT);
    errorstatus = SD_DATA_TIMEOUT;
	ERR_printf(errorstatus);
    return(errorstatus);
  }
  else if (SDIO_GetFlagStatus(SDIO_FLAG_DCRCFAIL) != RESET){
    SDIO_ClearFlag(SDIO_FLAG_DCRCFAIL);
    errorstatus = SD_DATA_CRC_FAIL;
	ERR_printf(errorstatus);
    return(errorstatus);
  }
  else if (SDIO_GetFlagStatus(SDIO_FLAG_RXOVERR) != RESET){
    SDIO_ClearFlag(SDIO_FLAG_RXOVERR);
    errorstatus = SD_RX_OVERRUN;
	ERR_printf(errorstatus);
    return(errorstatus);
  }
  else if (SDIO_GetFlagStatus(SDIO_FLAG_STBITERR) != RESET){
    SDIO_ClearFlag(SDIO_FLAG_STBITERR);
    errorstatus = SD_START_BIT_ERR;
	ERR_printf(errorstatus);
    return(errorstatus);
  }
  /*!< Clear all the static flags */
  SDIO_ClearFlag(SDIO_STATIC_FLAGS);

  *(pscr + 1) = ((tempscr[0] & SD_0TO7BITS) << 24) | ((tempscr[0] & SD_8TO15BITS) << 8) | ((tempscr[0] & SD_16TO23BITS) >> 8) | ((tempscr[0] & SD_24TO31BITS) >> 24);

  *(pscr) = ((tempscr[1] & SD_0TO7BITS) << 24) | ((tempscr[1] & SD_8TO15BITS) << 8) | ((tempscr[1] & SD_16TO23BITS) >> 8) | ((tempscr[1] & SD_24TO31BITS) >> 24);

  return(errorstatus);
}




SD_Error SD_ReadBlock(u8 *readbuff, uint64_t ReadAddr, u16 BlockSize)
{
  SD_Error errorstatus = SD_OK;
#if defined (SD_POLLING_MODE) 
  u32 count = 0, *tempbuff = (u32 *)readbuff;
#endif

  TransferError = SD_OK;
  TransferISEnd = 0;
  StopCondition = 0;

  SDIO->DCTRL = 0x0;

#if defined (SD_DMA_MODE)
  __SDIO_ENABLE_IT(SDIO,SDIO_IT_DCRCFAIL | SDIO_IT_DTIMEOUT | SDIO_IT_DATAEND | SDIO_IT_RXOVERR | SDIO_IT_STBITERR);
  __SDIO_DMA_ENABLE(SDIO);
  SD_LowLevel_DMA_RxConfig((u32 *)readbuff, BlockSize);
#endif

  if (CardType == SDIO_HIGH_CAPACITY_SD_CARD)
  {
    BlockSize = 512;
    ReadAddr /= 512;
  }


  
  /* Set Block Size for Card */ 
  sdio_send_cmd(SD_CMD_SET_BLOCKLEN, (u32)BlockSize, SDIO_RESPONSE_SHORT);
  
  errorstatus = CmdResp1Error(SD_CMD_SET_BLOCKLEN);

  if (SD_OK != errorstatus){
	ERR_printf(errorstatus);
    return(errorstatus);
  }
  sdio_data_cfg(BlockSize, SDIO_TRANSFER_DIR_TO_SDIO, SDIO_DATABLOCK_SIZE_512B);
  
  /*!< Send CMD17 READ_SINGLE_BLOCK */
  sdio_send_cmd(SD_CMD_READ_SINGLE_BLOCK, (u32)ReadAddr, SDIO_RESPONSE_SHORT);
 
  errorstatus = CmdResp1Error(SD_CMD_READ_SINGLE_BLOCK);
  if (errorstatus != SD_OK){
	ERR_printf(errorstatus);
    return(errorstatus);
  }

////  if(__HAL_SD_GET_FLAG(hsd, SDIO_FLAG_RXFIFOHF))
////  {
////	/* Read data from SDIO Rx FIFO */
////	for(count = 0U; count < 8U; count++)
////	{
////	  *(tempbuff + count) = SDIO_ReadFIFO(hsd->Instance);
////	}
////	tempbuff += 8U;
////  }

  return(errorstatus);
}


SD_Error SD_ReadMultiBlocks(u8 *readbuff, uint64_t ReadAddr, u16 BlockSize, u32 NumberOfBlocks)
{
  SD_Error errorstatus = SD_OK;
  TransferError = SD_OK;
  TransferISEnd = 0;
  StopCondition = 1;
	
  SDIO->DCTRL = 0x0;



	
	
  __SDIO_ENABLE_IT(SDIO,SDIO_IT_DCRCFAIL | SDIO_IT_DTIMEOUT | SDIO_IT_DATAEND | SDIO_IT_RXOVERR | SDIO_IT_STBITERR); 
  __SDIO_DMA_ENABLE(SDIO);
  SD_LowLevel_DMA_RxConfig((u32 *)readbuff, (NumberOfBlocks * BlockSize));
  if (CardType == SDIO_HIGH_CAPACITY_SD_CARD)
  {
    BlockSize = 512;
    ReadAddr /= 512;
  }
  /*!< Set Block Size for Card */
  sdio_send_cmd(SD_CMD_SET_BLOCKLEN, (u32)BlockSize, SDIO_RESPONSE_SHORT);
  errorstatus = CmdResp1Error(SD_CMD_SET_BLOCKLEN);
  if (SD_OK != errorstatus){
	ERR_printf(errorstatus);
    return(errorstatus);
  }
    
  sdio_data_cfg(NumberOfBlocks * BlockSize, SDIO_TRANSFER_DIR_TO_SDIO, SDIO_DATABLOCK_SIZE_512B);
  
  /*!< Send CMD18 READ_MULT_BLOCK with argument data address */
  sdio_send_cmd(SD_CMD_READ_MULT_BLOCK, (u32)ReadAddr, SDIO_RESPONSE_SHORT);
  errorstatus = CmdResp1Error(SD_CMD_READ_MULT_BLOCK);
  if (errorstatus != SD_OK){
	ERR_printf(errorstatus);
    return(errorstatus);
  }
  
  return(errorstatus);
}



/**
  * @brief  Aborts an ongoing data transfer.
  * @param  None
  * @retval SD_Error: SD Card Error code.
  */
SD_Error SD_StopTransfer(void)
{
  SD_Error errorstatus = SD_OK;
  /*!< Send CMD12 STOP_TRANSMISSION  */
  sdio_send_cmd(SD_CMD_STOP_TRANSMISSION, (u32)0, SDIO_RESPONSE_SHORT);    
  errorstatus = CmdResp1Error(SD_CMD_STOP_TRANSMISSION);
  return(errorstatus);
}

/**
  * @brief  This function waits until the SDIO DMA data transfer is finished. 
  *         This function should be called after SDIO_ReadMultiBlocks() function
  *         to insure that all data sent by the card are already transferred by 
  *         the DMA controller.
  * @param  None.
  * @retval SD_Error: SD Card Error code.
  */
SD_Error SD_WaitReadOperation(void)
{
  SD_Error errorstatus = SD_OK;
  uint32_t timeout;

  timeout = SD_DATATIMEOUT;
  
  while ((DMAEndOfTransfer == 0x00) && (TransferISEnd == 0) && (TransferError == SD_OK) && (timeout > 0))
  {
	  sd_printf("timeout:%d  line:%d\n",timeout, __LINE__);
      timeout--;
  }
  
  DMAEndOfTransfer = 0x00;
  timeout = SD_DATATIMEOUT;
  while(((SDIO->STA & SDIO_FLAG_RXACT)) && (timeout > 0))
  {
	sd_printf("timeout:%d  line:%d\n",timeout, __LINE__);
	 sd_printf("SDIO_ReadData:%d  ,LINE:%d \n", SDIO_ReadData(), __LINE__);
	 
