mynamelcz/stm32F4/DEV/sdio_SD/sdio_sd.c
    timeout--;  
  }

  if (StopCondition == 1){
    errorstatus = SD_StopTransfer();
    StopCondition = 0;
  }
  
  if ((timeout == 0) && (errorstatus == SD_OK)){
    errorstatus = SD_DATA_TIMEOUT;
  }
  
  /*!< Clear all the static flags */
  SDIO_ClearFlag(SDIO_STATIC_FLAGS);

  if (TransferError != SD_OK){
	ERR_printf(TransferError);
    return(TransferError);
  }else{
    return(errorstatus);  
  }
}

/**
  * @brief  Returns the current card's status.
  * @param  pcardstatus: pointer to the buffer that will contain the SD card 
  *         status (Card Status register).
  * @retval SD_Error: SD Card Error code.
  */
SD_Error SD_SendStatus(u32 *pcardstatus)
{
  SD_Error errorstatus = SD_OK;

  if (pcardstatus == NULL){
    errorstatus = SD_INVALID_PARAMETER;
	ERR_printf(TransferError);
    return(errorstatus);
  }
  sdio_send_cmd(SD_CMD_SEND_STATUS, (u32)RCA << 16, SDIO_RESPONSE_SHORT);    
  
  errorstatus = CmdResp1Error(SD_CMD_SEND_STATUS);
  if (errorstatus != SD_OK){
	ERR_printf(TransferError);
    return(errorstatus);
  }
  *pcardstatus = SDIO_GetResponse(SDIO, SDIO_RESP1);
  return(errorstatus);
}

u8 SD_Detect(void)
{
  volatile u8 status = SD_PRESENT;

  /*!< Check GPIO to detect SD */
//  if (GPIO_ReadInputDataBit(SD_DETECT_GPIO_PORT, SD_DETECT_PIN) != Bit_RESET)
//  {
//    status = SD_NOT_PRESENT;
//  }
  return status;
}
/**
  * @brief  Returns the current card's state.
  * @param  None
  * @retval SDCardState: SD Card Error or SD Card Current State.
  */
SDCardState SD_GetState(void)
{
  uint32_t resp1 = 0;
  
  if(SD_Detect()== SD_PRESENT){
    if (SD_SendStatus(&resp1) != SD_OK){
	  ERR_printf(TransferError);
      return SD_CARD_ERROR;
    }
    else{
      return (SDCardState)((resp1 >> 9) & 0x0F);
    }
  }else{
	ERR_printf(TransferError);
    return SD_CARD_ERROR;
  }
}

SDTransferState SD_GetStatus(void)
{
  SDCardState cardstate =  SD_CARD_TRANSFER;

  cardstate = SD_GetState();
  if (cardstate == SD_CARD_TRANSFER){
    return(SD_TRANSFER_OK);
  }else if(cardstate == SD_CARD_ERROR){
    return (SD_TRANSFER_ERROR);
  }else{
    return(SD_TRANSFER_BUSY);
  }
}

SD_Error sdio_read_blocks(u8 *readbuff, uint64_t ReadAddr, u16 BlockSize, u32 NumberOfBlocks)
{
	uint32_t timeout;
	SD_Error Status;
	timeout = SD_DATATIMEOUT;
	if(NumberOfBlocks==0)return SD_OK;
	if(NumberOfBlocks == 1){
		Status = SD_ReadBlock(readbuff, ReadAddr, BlockSize);
	}else{
		Status = SD_ReadMultiBlocks(readbuff, ReadAddr, BlockSize, NumberOfBlocks);
	}
	
	

	if(Status == SD_OK){
		Status = SD_WaitReadOperation();
		if(Status == SD_OK){
			while((SD_GetStatus() != SD_TRANSFER_OK)&&(--timeout));
			if(timeout){
				return SD_OK;
			}
		}		
	}
	ERR_printf(Status);
	return Status;
}


SD_Error SD_WriteBlock(u8 *writebuff, uint64_t WriteAddr, u16 BlockSize)
{
  SD_Error errorstatus = SD_OK;

#if defined (SD_POLLING_MODE)
  u32 bytestransferred = 0, count = 0, restwords = 0;
  u32 *tempbuff = (u32 *)writebuff;
#endif

  TransferError = SD_OK;
  TransferISEnd = 0;
  StopCondition = 0;

  SDIO->DCTRL = 0x0;

#if defined (SD_DMA_MODE)
  __SDIO_ENABLE_IT(SDIO,SDIO_IT_DCRCFAIL | SDIO_IT_DTIMEOUT | SDIO_IT_DATAEND | SDIO_IT_RXOVERR | SDIO_IT_STBITERR); 
 SD_LowLevel_DMA_TxConfig((u32 *)writebuff, BlockSize);
  __SDIO_DMA_ENABLE(SDIO);
#endif

  if (CardType == SDIO_HIGH_CAPACITY_SD_CARD)
  {
    BlockSize = 512;
    WriteAddr /= 512;
  }

  /* Set Block Size for Card */ 
  sdio_send_cmd(SD_CMD_SET_BLOCKLEN, (u32)BlockSize, SDIO_RESPONSE_SHORT);  
  
  errorstatus = CmdResp1Error(SD_CMD_SET_BLOCKLEN);
  if (SD_OK != errorstatus){
	ERR_printf(TransferError);
    return(errorstatus);
  }

  /*!< Send CMD24 WRITE_SINGLE_BLOCK */
  sdio_send_cmd(SD_CMD_WRITE_SINGLE_BLOCK, (u32)WriteAddr, SDIO_RESPONSE_SHORT);  
  
  errorstatus = CmdResp1Error(SD_CMD_WRITE_SINGLE_BLOCK);
  if (errorstatus != SD_OK){
	ERR_printf(TransferError);
    return(errorstatus);
  }

  sdio_data_cfg(BlockSize, SDIO_TRANSFER_DIR_TO_CARD, SDIO_DATABLOCK_SIZE_512B);
  
  

  
  return(errorstatus);
}

/**
  * @brief  Allows to write blocks starting from a specified address in a card.
  *         The Data transfer can be managed by DMA mode only. 
  * @note   This operation should be followed by two functions to check if the 
  *         DMA Controller and SD Card status.
  *          - SD_ReadWaitOperation(): this function insure that the DMA
  *            controller has finished all data transfer.
  *          - SD_GetStatus(): to check that the SD Card has finished the 
  *            data transfer and it is ready for data.     
  * @param  WriteAddr: Address from where data are to be read.
  * @param  writebuff: pointer to the buffer that contain the data to be transferred.
  * @param  BlockSize: the SD card Data block size. The Block size should be 512.
  * @param  NumberOfBlocks: number of blocks to be written.
  * @retval SD_Error: SD Card Error code.
  */
SD_Error SD_WriteMultiBlocks(u8 *writebuff, uint64_t WriteAddr, u16 BlockSize, u32 NumberOfBlocks)
{
  SD_Error errorstatus = SD_OK;

  TransferError = SD_OK;
  TransferISEnd = 0;
  StopCondition = 1;
  SDIO->DCTRL = 0x0;

  __SDIO_ENABLE_IT(SDIO,SDIO_IT_DCRCFAIL | SDIO_IT_DTIMEOUT | SDIO_IT_DATAEND | SDIO_IT_RXOVERR | SDIO_IT_STBITERR); 
  SD_LowLevel_DMA_TxConfig((u32 *)writebuff, (NumberOfBlocks * BlockSize));
  __SDIO_DMA_ENABLE(SDIO);
  if (CardType == SDIO_HIGH_CAPACITY_SD_CARD)
  {
    BlockSize = 512;
    WriteAddr /= 512;
  }

  /* Set Block Size for Card */ 
  sdio_send_cmd(SD_CMD_SET_BLOCKLEN, (u32)BlockSize, SDIO_RESPONSE_SHORT);   
  
  errorstatus = CmdResp1Error(SD_CMD_SET_BLOCKLEN);
  if (SD_OK != errorstatus){
	ERR_printf(TransferError);
    return(errorstatus);
  }
  
  /*!< To improve performance */
  sdio_send_cmd(SD_CMD_APP_CMD, (u32) (RCA << 16), SDIO_RESPONSE_SHORT);   
  
  errorstatus = CmdResp1Error(SD_CMD_APP_CMD);
  if (errorstatus != SD_OK){
	ERR_printf(TransferError);
    return(errorstatus);
  }
  /*!< To improve performance */
  sdio_send_cmd(SD_CMD_SET_BLOCK_COUNT, (u32) NumberOfBlocks, SDIO_RESPONSE_SHORT);    
  
  errorstatus = CmdResp1Error(SD_CMD_SET_BLOCK_COUNT);
  if (errorstatus != SD_OK){
	ERR_printf(TransferError);
    return(errorstatus);
  }


  /*!< Send CMD25 WRITE_MULT_BLOCK with argument data address */
  sdio_send_cmd(SD_CMD_WRITE_MULT_BLOCK, (u32)WriteAddr, SDIO_RESPONSE_SHORT);   
  
  errorstatus = CmdResp1Error(SD_CMD_WRITE_MULT_BLOCK);
  if (SD_OK != errorstatus){
	ERR_printf(TransferError);
    return(errorstatus);
  }

  sdio_data_cfg(NumberOfBlocks * BlockSize, SDIO_TRANSFER_DIR_TO_CARD, SDIO_DATABLOCK_SIZE_512B);
  
  return(errorstatus);
}

/**
  * @brief  This function waits until the SDIO DMA data transfer is finished. 
  *         This function should be called after SDIO_WriteBlock() and
  *         SDIO_WriteMultiBlocks() function to insure that all data sent by the 
  *         card are already transferred by the DMA controller.        
  * @param  None.
  * @retval SD_Error: SD Card Error code.
  */
SD_Error SD_WaitWriteOperation(void)
{
  SD_Error errorstatus = SD_OK;
  u32 timeout;

  timeout = SD_DATATIMEOUT;
  
  while ((DMAEndOfTransfer == 0x00) && (TransferISEnd == 0) && (TransferError == SD_OK) && (timeout > 0))
  {
    timeout--;
  }
  
  DMAEndOfTransfer = 0x00;

  timeout = SD_DATATIMEOUT;
  
