mynamelcz/stm32F4/DEV/sdio_SD/sdio_sd.c
  while(((SDIO->STA & SDIO_FLAG_TXACT)) && (timeout > 0))
  {
	  
	  sd_printf("SDIO->STA :0x%x LINE:%d\n",SDIO->STA, __LINE__);
	  SDIO_WriteFIFO(SDIO, &timeout);
      timeout--;  
  }

  if (StopCondition == 1)
  {
    errorstatus = SD_StopTransfer();
    StopCondition = 0;
  }
  
  if ((timeout == 0) && (errorstatus == SD_OK))
  {
    errorstatus = SD_DATA_TIMEOUT;
  }
  
  /*!< Clear all the static flags */
  SDIO_ClearFlag(SDIO_STATIC_FLAGS);
  
  if (TransferError != SD_OK)
  {
    return(TransferError);
  }
  else
  {
    return(errorstatus);
  }
}

/**
  * @brief  Gets the cuurent data transfer state.
  * @param  None
  * @retval SDTransferState: Data Transfer state.
  *   This value can be: 
  *        - SD_TRANSFER_OK: No data transfer is acting
  *        - SD_TRANSFER_BUSY: Data transfer is acting
  */
SDTransferState SD_GetTransferState(void)
{
  if (SDIO->STA & (SDIO_FLAG_TXACT | SDIO_FLAG_RXACT))
  {
    return(SD_TRANSFER_BUSY);
  }
  else
  {
    return(SD_TRANSFER_OK);
  }
}





u8 test_buf[1024];
SD_Error SD_Init(void)
{
  __IO SD_Error errorstatus = SD_OK;
	
  errorstatus = SD_PowerON();
  if (errorstatus != SD_OK)
  {
	ERR_printf(errorstatus);
    return(errorstatus);
  }
  errorstatus = SD_InitializeCards();
  
  if (errorstatus != SD_OK)
  {
    ERR_printf(errorstatus);
    return(errorstatus);
  }
  
  sdio_set_high_speed(SDIO_BUS_WIDE_1B);
  /*----------------- Read CSD/CID MSD registers ------------------*/
  errorstatus = SD_GetCardInfo(&SDCardInfo);
  
  
  if (errorstatus == SD_OK){
    /*----------------- Select Card --------------------------------*/
    errorstatus = SD_SelectDeselect((uint32_t) (SDCardInfo.RCA << 16));
  }
  if (errorstatus == SD_OK){
     errorstatus = SD_EnableWideBusOperation(SDIO_BUS_WIDE_4B);
  }else{
	 ERR_printf(errorstatus);
  }
/////////////////////////////////////////////////////////////
//	SD_ReadBlock(test_buf, 0, 512);
  
  u16 i=0;
  for(;i<1024;i++){
	test_buf[i] = 0xbb;
  }
  
    sdio_read_blocks(test_buf, 0, 512, 1);
    sd_puthex((const char *)test_buf, 512);

//     SD_WriteBlock(test_buf, 512, 512);
//   SD_WaitWriteOperation();
//      sdio_read_blocks(test_buf, 512, 512, 1);
//    sd_puthex((const char *)test_buf, 512);
/////////////////////////////////////////////////////////////  
  
  
  
  return(errorstatus);
}  
  
  
  
SD_Error SD_ProcessIRQSrc(void)
{ 
  if (SDIO_GetITStatus(SDIO_IT_DATAEND) != RESET)
  {
    TransferError = SD_OK;
    SDIO_ClearITPendingBit(SDIO_IT_DATAEND);
    TransferISEnd = 1;
  }  
  else if (SDIO_GetITStatus(SDIO_IT_DCRCFAIL) != RESET)
  {
    SDIO_ClearITPendingBit(SDIO_IT_DCRCFAIL);
    TransferError = SD_DATA_CRC_FAIL;
	ERR_printf(TransferError);
  }
  else if (SDIO_GetITStatus(SDIO_IT_DTIMEOUT) != RESET)
  {
    SDIO_ClearITPendingBit(SDIO_IT_DTIMEOUT);
    TransferError = SD_DATA_TIMEOUT;
	ERR_printf(TransferError);
  }
  else if (SDIO_GetITStatus(SDIO_IT_RXOVERR) != RESET)
  {
    SDIO_ClearITPendingBit(SDIO_IT_RXOVERR);
    TransferError = SD_RX_OVERRUN;
	ERR_printf(TransferError);
  }
  else if (SDIO_GetITStatus(SDIO_IT_TXUNDERR) != RESET)
  {
    SDIO_ClearITPendingBit(SDIO_IT_TXUNDERR);
    TransferError = SD_TX_UNDERRUN;
	ERR_printf(TransferError);
  }
  else if (SDIO_GetITStatus(SDIO_IT_STBITERR) != RESET)
  {
    SDIO_ClearITPendingBit(SDIO_IT_STBITERR);
    TransferError = SD_START_BIT_ERR;
	ERR_printf(TransferError);
  }

  SDIO_ITConfig(SDIO_IT_DCRCFAIL | SDIO_IT_DTIMEOUT | SDIO_IT_DATAEND |
                SDIO_IT_TXFIFOHE | SDIO_IT_RXFIFOHF | SDIO_IT_TXUNDERR |
                SDIO_IT_RXOVERR | SDIO_IT_STBITERR, DISABLE);
  return(TransferError);
}



void SDIO_IRQHandler(void)
{
	SD_ProcessIRQSrc();
}





/////////////////////////////////////////////////////////////////////////////




SD_Error SD_EnableWideBusOperation(u32 WideMode)
{
  SD_Error errorstatus = SD_OK;

  /*!< MMC Card doesn't support this feature */
  if (SDIO_MULTIMEDIA_CARD == CardType){
    errorstatus = SD_UNSUPPORTED_FEATURE;
	ERR_printf(errorstatus);
    return(errorstatus);
  }else if ((SDIO_STD_CAPACITY_SD_CARD_V1_1 == CardType) ||
			(SDIO_STD_CAPACITY_SD_CARD_V2_0 == CardType) || 
			(SDIO_HIGH_CAPACITY_SD_CARD 	== CardType)){
				
    if (SDIO_BUS_WIDE_8B == WideMode){
      errorstatus = SD_UNSUPPORTED_FEATURE;
	  ERR_printf(errorstatus);
      return(errorstatus);
    }else if (SDIO_BUS_WIDE_4B == WideMode){
      errorstatus = SDEnWideBus(ENABLE);
      if (SD_OK == errorstatus){
        /*!< Configure the SDIO peripheral */
		  sdio_set_high_speed(SDIO_BUS_WIDE_4B); 
		  sd_printf("SDIO BUS Width 4_Bit\n");
      }
    }else{
      errorstatus = SDEnWideBus(DISABLE);
      if (SD_OK == errorstatus){
        /*!< Configure the SDIO peripheral */
		  sdio_set_high_speed(SDIO_BUS_WIDE_1B);
		  sd_printf("SDIO BUS Width 1_Bit\n");
      }
    }
  }
  return(errorstatus);
}
/*
* 设置SD卡总线宽度
*/
static SD_Error SDEnWideBus(FunctionalState NewState)
{
  SD_Error errorstatus = SD_OK;
  u32 scr[2] = {0, 0};
  if (SDIO_GetResponse(SDIO, SDIO_RESP1) & SD_CARD_LOCKED){
    errorstatus = SD_LOCK_UNLOCK_FAILED;
	ERR_printf(errorstatus);
    return(errorstatus);
  }

  /*!< Get SCR Register */
  errorstatus = FindSCR(RCA, scr);

  if (errorstatus != SD_OK){
	ERR_printf(errorstatus);
    return(errorstatus);
  }

  /*!< If wide bus operation to be enabled */
  if (NewState == ENABLE)
  {
    /*!< If requested card supports wide bus operation */
    if ((scr[1] & SD_WIDE_BUS_SUPPORT) != SD_ALLZERO)
    {
      /*!< Send CMD55 APP_CMD with argument as card's RCA.*/
	  sdio_send_cmd(SD_CMD_APP_CMD, (u32) RCA << 16, SDIO_RESPONSE_SHORT);
      errorstatus = CmdResp1Error(SD_CMD_APP_CMD);
		
      if (errorstatus != SD_OK){
		ERR_printf(errorstatus);
        return(errorstatus);
      }

      /*!< Send ACMD6 APP_CMD with argument as 2 for wide bus mode */
	  sdio_send_cmd(SD_CMD_APP_SD_SET_BUSWIDTH, (u32) 0x2, SDIO_RESPONSE_SHORT);
	  
      errorstatus = CmdResp1Error(SD_CMD_APP_SD_SET_BUSWIDTH);
      if (errorstatus != SD_OK){
		ERR_printf(errorstatus);  
        return(errorstatus);
      }
      return(errorstatus);
    }
    else{
      errorstatus = SD_REQUEST_NOT_APPLICABLE;
	  ERR_printf(errorstatus);
      return(errorstatus);
    }
  }   /*!< If wide bus operation to be disabled */
  else
  {
    /*!< If requested card supports 1 bit mode operation */
    if ((scr[1] & SD_SINGLE_BUS_SUPPORT) != SD_ALLZERO)
    {
      /*!< Send CMD55 APP_CMD with argument as card's RCA.*/
	  sdio_send_cmd(SD_CMD_APP_CMD, (u32)RCA << 16, SDIO_RESPONSE_SHORT);
		
      errorstatus = CmdResp1Error(SD_CMD_APP_CMD);
      if (errorstatus != SD_OK){
		ERR_printf(errorstatus);
        return(errorstatus);
      }

      /*!< Send ACMD6 APP_CMD with argument as 2 for wide bus mode */
	  sdio_send_cmd(SD_CMD_APP_SD_SET_BUSWIDTH, (u32)0x00, SDIO_RESPONSE_SHORT);
	  
      errorstatus = CmdResp1Error(SD_CMD_APP_SD_SET_BUSWIDTH);
      if (errorstatus != SD_OK){
		ERR_printf(errorstatus);
        return(errorstatus);
      }  
      return(errorstatus);
    }else{
      errorstatus = SD_REQUEST_NOT_APPLICABLE;
	  ERR_printf(errorstatus);
      return(errorstatus);
    }
  }
}

/**
  * @brief  Checks for error conditions for CMD0.
  */
static SD_Error CmdError(void)
{
  SD_Error errorstatus = SD_OK;
  uint32_t timeout;

  timeout = SDIO_CMD0TIMEOUT; /*!< 10000 */

  while ((timeout > 0) && (SDIO_GetFlagStatus(SDIO_FLAG_CMDSENT) == RESET))
  {
    timeout--;
  }

  if (timeout == 0)
  {
	ERR_printf(SD_CMD_RSP_TIMEOUT);
    errorstatus = SD_CMD_RSP_TIMEOUT;
    return(errorstatus);
  }
  /*!< Clear all the static flags */
  SDIO_ClearFlag(SDIO_STATIC_FLAGS);
  return(errorstatus);
}

/**
  * @brief  Checks for error conditions for R7 response.
  */
static SD_Error CmdResp7Error(void)
{
  SD_Error errorstatus = SD_OK;
  uint32_t status;
  uint32_t timeout = SDIO_CMD0TIMEOUT;

  status = SDIO->STA;

  while (!(status & (SDIO_FLAG_CCRCFAIL | SDIO_FLAG_CMDREND | SDIO_FLAG_CTIMEOUT)) && (timeout > 0))
  {
    timeout--;
    status = SDIO->STA;
  }
  if ((timeout == 0) || (status & SDIO_FLAG_CTIMEOUT)){
    /*!< Card is not V2.0 complient or card does not support the set voltage range */
    errorstatus = SD_CMD_RSP_TIMEOUT;
	ERR_printf(errorstatus);
    SDIO_ClearFlag(SDIO_FLAG_CTIMEOUT);
    return(errorstatus);
  }
  if (status & SDIO_FLAG_CMDREND){
    /*!< Card is SD V2.0 compliant */
    errorstatus = SD_OK;
    SDIO_ClearFlag(SDIO_FLAG_CMDREND);
    return(errorstatus);
  }
  return(errorstatus);
}

/**
  * @brief  Checks for error conditions for R1 response.
  */
static SD_Error CmdResp1Error(uint8_t cmd)
{
  SD_Error errorstatus = SD_OK;
  uint32_t status;
  uint32_t response_r1;

  status = SDIO->STA;

  while (!(status & (SDIO_FLAG_CCRCFAIL | SDIO_FLAG_CMDREND | SDIO_FLAG_CTIMEOUT)))
  {
    status = SDIO->STA;
  }

