mynamelcz/stm32F4/DEV/sdio_SD/sdio_sd.c
  sdio_set_low_speed(SDIO_BUS_WIDE_1B);

  SDIO_PowerState_ON(SDIO);
  /*!< Enable SDIO Clock */
   __SDIO_ENABLE(SDIO);
  /*!< CMD0: GO_IDLE_STATE ---------------------------------------------------*/
  sdio_send_cmd(SD_CMD_GO_IDLE_STATE, 0x0, SDIO_RESPONSE_NO);
  errorstatus = CmdError();
  if (errorstatus != SD_OK)
  {
	ERR_printf(errorstatus);
    return(errorstatus);
  }
  /*!< CMD8: SEND_IF_COND ----------------------------------------------------*/
  /*!< Send CMD8 to verify SD card interface operating condition */
  /*!< CMD Response: R7 */
  sdio_send_cmd(SDIO_SEND_IF_COND, SD_CHECK_PATTERN, SDIO_RESPONSE_SHORT);
  errorstatus = CmdResp7Error();
  if (errorstatus == SD_OK){
    CardType = SDIO_STD_CAPACITY_SD_CARD_V2_0; /*!< SD Card 2.0 */
    SDType = SD_HIGH_CAPACITY;
  }
  else{
    /*!< CMD55 */
	sdio_send_cmd(SD_CMD_APP_CMD, 0x00, SDIO_RESPONSE_SHORT);
    errorstatus = CmdResp1Error(SD_CMD_APP_CMD);
  }
  /*!< CMD55 */
  sdio_send_cmd(SD_CMD_APP_CMD, 0x00, SDIO_RESPONSE_SHORT);
  errorstatus = CmdResp1Error(SD_CMD_APP_CMD);
  /*!< If errorstatus is Command TimeOut, it is a MMC card */
  /*!< If errorstatus is SD_OK it is a SD card: SD card 2.0 (voltage range mismatch)
     or SD card 1.x */
  if (errorstatus == SD_OK){
    /*!< SD CARD */
    /*!< Send ACMD41 SD_APP_OP_COND with Argument 0x80100000 */
    while ((!validvoltage) && (count < SD_MAX_VOLT_TRIAL))
    {
      /*!< SEND CMD55 APP_CMD with RCA as 0 */
	  sdio_send_cmd(SD_CMD_APP_CMD, 0x00, SDIO_RESPONSE_SHORT);	
      errorstatus = CmdResp1Error(SD_CMD_APP_CMD);
      if (errorstatus != SD_OK){
		ERR_printf(errorstatus);
        return(errorstatus);
      }
	  sdio_send_cmd(SD_CMD_SD_APP_OP_COND, SD_VOLTAGE_WINDOW_SD | SDType, SDIO_RESPONSE_SHORT);
      errorstatus = CmdResp3Error();
      if (errorstatus != SD_OK){
        return(errorstatus);
      }
      response = SDIO_Get_Response(SDIO_RESP1);
      validvoltage = (((response >> 31) == 1) ? 1 : 0);
      count++;
    }
    if (count >= SD_MAX_VOLT_TRIAL){
      errorstatus = SD_INVALID_VOLTRANGE;
	  ERR_printf(errorstatus);
      return(errorstatus);
    }
    if (response &= SD_HIGH_CAPACITY){
      CardType = SDIO_HIGH_CAPACITY_SD_CARD;
	  sd_printf(">>>>>  SDHC	CARD<<<<<\n");
    }else{
	  sd_printf(">>>>>  SDSC	CARD<<<<<\n");
	}

  }else{/*!< else MMC Card */
	sd_printf(">>>>>  MMC CARD<<<<<\n");
    ERR_printf(errorstatus);
  }
  return(errorstatus);
}


/*
* 1.读取 CSD  CID 
*/
SD_Error SD_InitializeCards(void)
{
  SD_Error errorstatus = SD_OK;
  u16 rca = 0x01;

  if (SDIO_GetPowerState(SDIO) == SDIO_POWER_STATE_OFF)
  {
    errorstatus = SD_REQUEST_NOT_APPLICABLE;
	ERR_printf(errorstatus);
    return(errorstatus);
  }
  if (SDIO_SECURE_DIGITAL_IO_CARD != CardType)
  {
    /*!< Send CMD2 ALL_SEND_CID */
	sdio_send_cmd(SD_CMD_ALL_SEND_CID, 0, SDIO_RESPONSE_LONG);   
    errorstatus = CmdResp2Error();
    if (SD_OK != errorstatus)
    {
      return(errorstatus);
    }
    CID_Tab[0] = SDIO_GetResponse(SDIO, SDIO_RESP1);
    CID_Tab[1] = SDIO_GetResponse(SDIO, SDIO_RESP2);
    CID_Tab[2] = SDIO_GetResponse(SDIO, SDIO_RESP3);
    CID_Tab[3] = SDIO_GetResponse(SDIO, SDIO_RESP4);
	
	sd_printf("CID TAB:	");
	sd_puthex((const char *)(CID_Tab), 16);
  }
  if ((SDIO_STD_CAPACITY_SD_CARD_V1_1 == CardType) ||  (SDIO_STD_CAPACITY_SD_CARD_V2_0 == CardType) ||  (SDIO_SECURE_DIGITAL_IO_COMBO_CARD == CardType)
      ||  (SDIO_HIGH_CAPACITY_SD_CARD == CardType))
  {
    /*!< Send CMD3 SET_REL_ADDR with argument 0 */
    /*!< SD Card publishes its RCA. */
	sdio_send_cmd(SD_CMD_SET_REL_ADDR, 0, SDIO_RESPONSE_SHORT);    
    errorstatus = CmdResp6Error(SD_CMD_SET_REL_ADDR, &rca);
    if (SD_OK != errorstatus){
	  ERR_printf(errorstatus);	
      return(errorstatus);
    }
	sd_printf("RCA: %x\n",rca);
  }

  if (SDIO_SECURE_DIGITAL_IO_CARD != CardType)
  {
    RCA = rca;
    /*!< Send CMD9 SEND_CSD with argument as card's RCA */
	sdio_send_cmd(SD_CMD_SEND_CSD, (u32)(rca << 16), SDIO_RESPONSE_LONG); 	    
    errorstatus = CmdResp2Error();
    if (SD_OK != errorstatus)
    {
	  ERR_printf(errorstatus);
      return(errorstatus);
    }

    CSD_Tab[0] = SDIO_GetResponse(SDIO, SDIO_RESP1);
    CSD_Tab[1] = SDIO_GetResponse(SDIO, SDIO_RESP2);
    CSD_Tab[2] = SDIO_GetResponse(SDIO, SDIO_RESP3);
    CSD_Tab[3] = SDIO_GetResponse(SDIO, SDIO_RESP4);
	sd_printf("CSD TAB:	");
	sd_puthex((const char *)(CSD_Tab), 16);
  }
  errorstatus = SD_OK; /*!< All cards get intialized */
  return(errorstatus);
}


SD_Error SD_SelectDeselect(uint64_t addr)
{
  SD_Error errorstatus = SD_OK;
  /*!< Send CMD7 SDIO_SEL_DESEL_CARD */
  sdio_send_cmd(SD_CMD_SEL_DESEL_CARD, (u32)addr, SDIO_RESPONSE_SHORT);
  errorstatus = CmdResp1Error(SD_CMD_SEL_DESEL_CARD);
  return(errorstatus);
}



/*
* 1.解析CSD 计算卡容量
*/
SD_Error SD_GetCardInfo(SD_CardInfo *cardinfo)
{
  SD_Error errorstatus = SD_OK;
  u8 tmp = 0;
  cardinfo->CardType = (u8)CardType;
  cardinfo->RCA = (u16)RCA;
  /*!< Byte 0 */
  tmp = (u8)((CSD_Tab[0] & 0xFF000000) >> 24);
  cardinfo->SD_csd.CSDStruct = (tmp & 0xC0) >> 6;
  cardinfo->SD_csd.SysSpecVersion = (tmp & 0x3C) >> 2;
  cardinfo->SD_csd.Reserved1 = tmp & 0x03;
  /*!< Byte 1 */
  tmp = (u8)((CSD_Tab[0] & 0x00FF0000) >> 16);
  cardinfo->SD_csd.TAAC = tmp;
  /*!< Byte 2 */
  tmp = (u8)((CSD_Tab[0] & 0x0000FF00) >> 8);
  cardinfo->SD_csd.NSAC = tmp;
  /*!< Byte 3 */
  tmp = (u8)(CSD_Tab[0] & 0x000000FF);
  cardinfo->SD_csd.MaxBusClkFrec = tmp;
  /*!< Byte 4 */
  tmp = (u8)((CSD_Tab[1] & 0xFF000000) >> 24);
  cardinfo->SD_csd.CardComdClasses = tmp << 4;
  /*!< Byte 5 */
  tmp = (u8)((CSD_Tab[1] & 0x00FF0000) >> 16);
  
  cardinfo->SD_csd.CardComdClasses |= (tmp & 0xF0) >> 4;
  cardinfo->SD_csd.RdBlockLen = tmp & 0x0F;


  /*!< Byte 6 */
  tmp = (u8)((CSD_Tab[1] & 0x0000FF00) >> 8);
  cardinfo->SD_csd.PartBlockRead = (tmp & 0x80) >> 7;
  cardinfo->SD_csd.WrBlockMisalign = (tmp & 0x40) >> 6;
  cardinfo->SD_csd.RdBlockMisalign = (tmp & 0x20) >> 5;
  cardinfo->SD_csd.DSRImpl = (tmp & 0x10) >> 4;
  cardinfo->SD_csd.Reserved2 = 0; /*!< Reserved */

